{"class_name": "Model", "keras_version": "1.1.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "dense_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 12544}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "dense_3"}, {"class_name": "Reshape", "config": {"target_shape": [14, 14, 64], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "reshape_1"}, {"class_name": "Deconvolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "deconvolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "activation": "relu", "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "output_shape": [null, 14, 14, 64], "border_mode": "same"}, "inbound_nodes": [[["reshape_1", 0, 0]]], "name": "deconvolution2d_1"}, {"class_name": "Deconvolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "deconvolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "activation": "relu", "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "output_shape": [null, 14, 14, 64], "border_mode": "same"}, "inbound_nodes": [[["deconvolution2d_1", 0, 0]]], "name": "deconvolution2d_2"}, {"class_name": "Deconvolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "deconvolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 2, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "activation": "relu", "b_regularizer": null, "W_regularizer": null, "nb_row": 2, "output_shape": [null, 28, 28, 64], "border_mode": "valid"}, "inbound_nodes": [[["deconvolution2d_2", 0, 0]]], "name": "deconvolution2d_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 2}, "inbound_nodes": [[["deconvolution2d_3", 0, 0]]], "name": "convolution2d_5"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["convolution2d_5", 0, 0]], "name": "decoder"}}